Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 reshape (Reshape)           (None, 28, 28, 1)         0         
                                                                 
 conv2d (Conv2D)             (None, 25, 25, 4)         68        
                                                                 
 conv2d_1 (Conv2D)           (None, 22, 22, 4)         260       
                                                                 
 conv2d_2 (Conv2D)           (None, 19, 19, 4)         260       
                                                                 
 conv2d_3 (Conv2D)           (None, 16, 16, 4)         260       
                                                                 
 flatten (Flatten)           (None, 1024)              0         
                                                                 
 dense (Dense)               (None, 64)                65600     
                                                                 
 dense_1 (Dense)             (None, 2)                 130       
                                                                 
=================================================================
Total params: 66,578
Trainable params: 66,578
Non-trainable params: 0
_________________________________________________________________
