Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 reshape (Reshape)           (None, 128, 128, 1)       0         
                                                                 
 conv2d (Conv2D)             (None, 125, 125, 4)       68        
                                                                 
 max_pooling2d (MaxPooling2D  (None, 62, 62, 4)        0         
 )                                                               
                                                                 
 batch_normalization (BatchN  (None, 62, 62, 4)        16        
 ormalization)                                                   
                                                                 
 conv2d_1 (Conv2D)           (None, 59, 59, 4)         260       
                                                                 
 max_pooling2d_1 (MaxPooling  (None, 29, 29, 4)        0         
 2D)                                                             
                                                                 
 batch_normalization_1 (Batc  (None, 29, 29, 4)        16        
 hNormalization)                                                 
                                                                 
 conv2d_2 (Conv2D)           (None, 28, 28, 2)         34        
                                                                 
 max_pooling2d_2 (MaxPooling  (None, 14, 14, 2)        0         
 2D)                                                             
                                                                 
 batch_normalization_2 (Batc  (None, 14, 14, 2)        8         
 hNormalization)                                                 
                                                                 
 conv2d_3 (Conv2D)           (None, 13, 13, 2)         18        
                                                                 
 max_pooling2d_3 (MaxPooling  (None, 6, 6, 2)          0         
 2D)                                                             
                                                                 
 batch_normalization_3 (Batc  (None, 6, 6, 2)          8         
 hNormalization)                                                 
                                                                 
 conv2d_4 (Conv2D)           (None, 5, 5, 2)           18        
                                                                 
 max_pooling2d_4 (MaxPooling  (None, 2, 2, 2)          0         
 2D)                                                             
                                                                 
 batch_normalization_4 (Batc  (None, 2, 2, 2)          8         
 hNormalization)                                                 
                                                                 
 flatten (Flatten)           (None, 8)                 0         
                                                                 
 dropout (Dropout)           (None, 8)                 0         
                                                                 
 dense (Dense)               (None, 64)                576       
                                                                 
 dense_1 (Dense)             (None, 2)                 130       
                                                                 
=================================================================
Total params: 1,160
Trainable params: 1,132
Non-trainable params: 28
_________________________________________________________________
