Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 reshape (Reshape)           (None, 128, 128, 1)       0         
                                                                 
 conv2d (Conv2D)             (None, 125, 125, 4)       68        
                                                                 
 max_pooling2d (MaxPooling2D  (None, 62, 62, 4)        0         
 )                                                               
                                                                 
 batch_normalization (BatchN  (None, 62, 62, 4)        16        
 ormalization)                                                   
                                                                 
 conv2d_1 (Conv2D)           (None, 59, 59, 4)         260       
                                                                 
 max_pooling2d_1 (MaxPooling  (None, 29, 29, 4)        0         
 2D)                                                             
                                                                 
 batch_normalization_1 (Batc  (None, 29, 29, 4)        16        
 hNormalization)                                                 
                                                                 
 conv2d_2 (Conv2D)           (None, 26, 26, 4)         260       
                                                                 
 max_pooling2d_2 (MaxPooling  (None, 13, 13, 4)        0         
 2D)                                                             
                                                                 
 batch_normalization_2 (Batc  (None, 13, 13, 4)        16        
 hNormalization)                                                 
                                                                 
 flatten (Flatten)           (None, 676)               0         
                                                                 
 dropout (Dropout)           (None, 676)               0         
                                                                 
 dense (Dense)               (None, 64)                43328     
                                                                 
 dense_1 (Dense)             (None, 2)                 130       
                                                                 
=================================================================
Total params: 44,094
Trainable params: 44,070
Non-trainable params: 24
_________________________________________________________________
